notes/3.3-concise-impl-of-linear-reg.org
#+PROPERTY: header-args    :tangle ../src/clj_d2l/linreg_easy.clj
* Concise Implementation of Linear Regression

Broad and intense interest in deep learning for the past several years
has inspired companies, academics, and hobbyists to develop a variety of
mature open source frameworks for automating the repetitive work of
implementing gradient-based learning algorithms. In
:numref:`sec_linear_scratch`, we relied only on (i) tensors for data
storage and linear algebra; and (ii) auto differentiation for
calculating gradients. In practice, because data iterators, loss
functions, optimizers, and neural network layers are so common, modern
libraries implement these components for us as well.

In this section, we will show you how to implement the linear
regression model from Section [[id:88932444-6698-410b-8af2-0ede52c6ad2d]]
concisely by using high-level APIs of deep learning frameworks.

** Generating the Dataset

To start, we will generate the same dataset as in Section
[[id:88932444-6698-410b-8af2-0ede52c6ad2d]].

#+begin_src clojure :results silent :eval no-export
(ns clj-d2l.linreg-easy
  (:require [clojure.java.io :as io]
            [clj-d2l.core :as d2l]
            [clj-djl.ndarray :as nd]
            [clj-djl.device :as device]
            [clj-djl.engine :as engine]
            [clj-djl.training.dataset :as ds]
            [clj-djl.model :as model]
            [clj-djl.nn :as nn]
            [clj-djl.training.loss :as loss]
            [clj-djl.training.tracker :as tracker]
            [clj-djl.training.optimizer :as optimizer]
            [clj-djl.training.parameter :as parameter]
            [clj-djl.training.initializer :as initializer]
            [clj-djl.training :as t]
            [clj-djl.training.listener :as listener])
  (:import [ai.djl.ndarray.types DataType]
           [java.nio.file Paths]))
#+end_src


#+begin_src clojure :results pp :exports both :eval no-export
(def ndm (nd/base-manager))
(def true-w (nd/create ndm (float-array [2 -3.4])))
(def true-b 4.2)
(def dp (d2l/synthetic-data ndm true-w true-b 1000))
(def features (get dp 0))
(def labels (get dp 1))
(println "features(0): "(nd/to-vec (nd/get features [0])))
(println "labels(0): " (nd/to-vec (nd/get labels [0])))
#+end_src

#+RESULTS:
: features(0):  [0.36353156 1.8406333]
: labels(0):  [-1.3278697]

