notes/3.3-concise-impl-of-linear-reg.org
** Reading the Dataset

Rather than rolling our own iterator, we can call upon the existing
API in a framework to read data. We pass in ~features~ and ~labels~ as
arguments and specify ~batch-size~ when instantiating a data iterator
object. Besides, the boolean value ~is-train~ indicates whether or not
we want the data iterator object to shuffle the data on each epoch
(pass through the dataset).

#+begin_src clojure :results silent :exports both
(def batch-size 10)
(def datasets (-> (ds/new-array-dataset-builder)
                  (ds/set-data features)
                  (ds/opt-labels labels)
                  ;; (defn set-sampling [batch-size shuffle] ...)
                  (ds/set-sampling batch-size false)
                  (ds/build)))
#+end_src

Now we can use ~get-data-iterator~ in much the same way as we called the
~data-iter~ function in Section
[[id:88932444-6698-410b-8af2-0ede52c6ad2d]]. To verify that it is working,
we can read and print the first minibatch of examples. Comparing with
Section [[id:88932444-6698-410b-8af2-0ede52c6ad2d]], here we use Clojure
function ~first~ to obtain the first item from the iterator.

#+begin_src clojure :results pp :exports both :eval no-export
(-> datasets
    (ds/get-data-iterator ndm) ;; generate a data iterator
    first ;; get the first batch
    ds/get-data ;; get the data
    first)
#+end_src

#+RESULTS:
#+begin_example
ND: (10, 2) cpu() float32
[[-2.2896,  1.0315],
 [-0.6617,  0.5531],
 [ 0.3967, -0.9902],
 [ 0.9992, -1.9574],
 [-0.9857, -0.1098],
 [-0.5344,  0.0834],
 [ 1.0844,  0.2221],
 [ 1.3125, -0.8627],
 [-0.581 ,  0.7608],
 [-1.4804,  0.2687],
]
#+end_example

#+begin_src clojure :results pp :exports both :eval no-export
(-> datasets
    (ds/get-data-iterator ndm) ;; generate a data iterator
    first ;; get the first batch
    ds/get-labels ;; get the labels
    first)
#+end_src

#+RESULTS:
: ND: (10) cpu() float32
: [ 5.7955,  3.7533, 11.8775,  6.7918,  3.2628,  2.2621,  1.5316, 10.5247, 15.5371, -0.0894]



* Defining the Model


When we implemented linear regression from scratch in Section
[[id:88932444-6698-410b-8af2-0ede52c6ad2d]], we defined our model
parameters explicitly and coded up the calculations to produce output
using basic linear algebra operations. You *should* know how to do
this. But once your models get more complex, and once you have to do
this nearly every day, you will be glad for the assistance. The
situation is similar to coding up your own blog from scratch. Doing it
once or twice is rewarding and instructive, but you would be a lousy
web developer if every time you needed a blog you spent a month
reinventing the wheel.

For standard operations, we can use a framework's predefined layers,
which allow us to focus especially on the layers used to construct the
model rather than having to focus on the implementation. We will first
define a model variable ~net~, which will refer to an instance of the
~sequential-block~ class. The ~sequential-block~ class defines a container
for several layers that will be chained together. Given input data, a
~sequential-block~ instance passes it through the first layer, in turn
passing the output as the second layer's input and so forth. In the
following example, our model consists of only one layer, so we do not
really need ~sequential-block~. But since nearly all of our future
models will involve multiple layers, we will use it anyway just to
familiarize you with the most standard workflow.

Recall the architecture of a single-layer network as shown in Fig
[[fig:single-neuron]]. The layer is said to be *fully-connected* because
each of its inputs is connected to each of its outputs by means of a
matrix-vector multiplication.

Now we define a model with name "lin-reg" and create a
~sequential-block~ with a ~linear-block~ inside it. And finally, set the
~sequential-block~ to the model.

#+begin_src clojure :results silent :exports both
(def model (model/new-instance "lin-reg"))
(def net (nn/sequential-block))
(def linear-block (nn/linear-block {:bias true
                                    :units 1}))
(nn/add net linear-block)
#+end_src

