docs/3.3-concise-impl-of-linear-reg.html

<div id="outline-container-org441e1cf" class="outline-3">
<h3 id="org441e1cf"><span class="section-number-3">1.2.</span> Reading the Dataset</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Rather than rolling our own iterator, we can call upon the existing
API in a framework to read data. We pass in <code>features</code> and <code>labels</code> as
arguments and specify <code>batch-size</code> when instantiating a data iterator
object. Besides, the boolean value <code>is-train</code> indicates whether or not
we want the data iterator object to shuffle the data on each epoch
(pass through the dataset).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">batch-size</span> 10<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">datasets</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/new-array-dataset-builder<span style="color: #909183;">)</span>
                  <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/set-data features<span style="color: #909183;">)</span>
                  <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/opt-labels labels<span style="color: #909183;">)</span>
                  <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">(defn set-sampling [batch-size shuffle] ...)</span>
                  <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/set-sampling batch-size <span style="color: #110099;">false</span><span style="color: #909183;">)</span>
                  <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/build<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Now we can use <code>get-data-iterator</code> in much the same way as we called the
<code>data-iter</code> function in Section
<a href="3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch">3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch</a>. To
verify that it is working, we can read and print the first minibatch
of examples. Comparing with Section
<a href="3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch">3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch</a>, here
we use Clojure function <code>first</code> to obtain the first item from the
iterator.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> datasets
    <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator ndm<span style="color: #7388d6;">)</span> <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">generate a data iterator</span>
    first <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">get the first batch</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">get the data</span>
    first<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example" id="org1c7d709">
ND: (10, 2) cpu() float32
[[-2.2896,  1.0315],
 [-0.6617,  0.5531],
 [ 0.3967, -0.9902],
 [ 0.9992, -1.9574],
 [-0.9857, -0.1098],
 [-0.5344,  0.0834],
 [ 1.0844,  0.2221],
 [ 1.3125, -0.8627],
 [-0.581 ,  0.7608],
 [-1.4804,  0.2687],
]
</pre>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> datasets
    <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator ndm<span style="color: #7388d6;">)</span> <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">generate a data iterator</span>
    first <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">get the first batch</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-labels <span style="color: #3F7F5F;">;; </span><span style="color: #3F7F5F;">get the labels</span>
    first<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (10) cpu() float32
[ 5.7955,  3.7533, 11.8775,  6.7918,  3.2628,  2.2621,  1.5316, 10.5247, 15.5371, -0.0894]
</pre>
</div>
</div>
</div>



<div id="outline-container-org2a6a39f" class="outline-2">
<h2 id="org2a6a39f"><span class="section-number-2">2.</span> Defining the Model</h2>
<div class="outline-text-2" id="text-2">
<p>
When we implemented linear regression from scratch in Section
<a href="3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch">3.2-linear-reg-impl-from-scratch.html#lin-reg-scratch</a>, we
defined our model parameters explicitly and coded up the calculations
to produce output using basic linear algebra operations. You <b>should</b>
know how to do this. But once your models get more complex, and once
you have to do this nearly every day, you will be glad for the
assistance. The situation is similar to coding up your own blog from
scratch. Doing it once or twice is rewarding and instructive, but you
would be a lousy web developer if every time you needed a blog you
spent a month reinventing the wheel.
</p>

<p>
For standard operations, we can use a framework&rsquo;s predefined layers,
which allow us to focus especially on the layers used to construct the
model rather than having to focus on the implementation. We will first
define a model variable <code>net</code>, which will refer to an instance of the
<code>sequential-block</code> class. The <code>sequential-block</code> class defines a container
for several layers that will be chained together. Given input data, a
<code>sequential-block</code> instance passes it through the first layer, in turn
passing the output as the second layer&rsquo;s input and so forth. In the
following example, our model consists of only one layer, so we do not
really need <code>sequential-block</code>. But since nearly all of our future
models will involve multiple layers, we will use it anyway just to
familiarize you with the most standard workflow.
</p>

<p>
Recall the architecture of a single-layer network as shown in Fig
<a href="3.1-linear-regression.html#org30de283">3.1-linear-regression.html#org30de283</a>. The layer is
said to be <b>fully-connected</b> because each of its inputs is connected to
each of its outputs by means of a matrix-vector multiplication.
</p>

<p>
Now we define a model with name &ldquo;lin-reg&rdquo; and create a
<code>sequential-block</code> with a <code>linear-block</code> inside it. And finally, set the
<code>sequential-block</code> to the model.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">model</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">model</span>/new-instance <span style="color: #2A00FF;">"lin-reg"</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">net</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nn</span>/sequential-block<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">linear-block</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nn</span>/linear-block <span style="color: #909183;">{</span><span style="color: #110099;">:bias</span> <span style="color: #110099;">true</span>
                                    <span style="color: #110099;">:units</span> 1<span style="color: #909183;">}</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nn</span>/add net linear-block<span style="color: #707183;">)</span>
</pre>
</div>
</div>
