notes/3.3-concise-impl-of-linear-reg.org
** Initializing Model Parameters

Before using ~net~, we need to initialize the model parameters, such as
the weights and bias in the linear regression model. Deep learning
frameworks often have a predefined way to initialize the parameters.
Here we specify that each weight parameter should be randomly sampled
from a normal distribution with mean 0 and standard deviation
0.01. The bias parameter will be initialized to zero.

We import the ~initializer~ namespace from ~clj-djl~. This module provides
various methods for model parameter initialization. We only specify
how to initialize the weight by calling ~(normal-initializer
0.01)~. Bias parameters are initialized to zero by default.

#+begin_src clojure :results pp :exports both :eval no-export
(nn/set-initializer net (initializer/normal-initializer 0.01) parameter/weight)
(model/set-block model net)
#+end_src

#+RESULTS:
: Model (
: 	Name: lin-reg
: 	Data Type: float32
: )

The code above may look straightforward but you should note that
something strange is happening here. We are initializing parameters
for a network even though clj-djl does not yet know how many
dimensions the input will have! It might be 2 as in our example or it
might be 2000. clj-djl lets us get away with this because behind the
scene, the initialization is actually deferred. The real
initialization will take place only when we for the first time attempt
to pass data through the network. Just be careful to remember that
since the parameters have not been initialized yet, we cannot access
or manipulate them.

** Defining the Loss Function

In clj-djl, the loss namespace defines various loss functions. In this
example, we will use the squared loss (l2-Loss).

#+begin_src clojure :results pp :exports both :eval no-export
(def loss (loss/l2-loss))
#+end_src

#+RESULTS:
: #'clj-d2l.linreg-easy/loss


** Defining the Optimization Algorithm

Minibatch stochastic gradient descent is a standard tool for
optimizing neural networks and thus clj-djl supports it alongside a
number of variations on this algorithm through its ~trainer~. When we
instantiate ~trainer~, we will specify the parameters to optimize over,
the optimization algorithm we wish to use (sgd), and a dictionary of
hyperparameters required by our optimization algorithm. Minibatch
stochastic gradient descent just requires that we set the value
learning rate, which is set to 0.03 here.

#+begin_src clojure :results pp :exports both :eval no-export
(def lrt (tracker/fixed 0.3))
(def sgd (optimizer/sgd {:tracker lrt}))
#+end_src

#+RESULTS:
: #'clj-d2l.linreg-easy/sgd


** Instantiate Configuration and Trainer

#+begin_src clojure :results pp :exports both :eval no-export
(def trainer (t/trainer {:model model
                         :loss loss
                         :optimizer sgd
                         :listeners (listener/logging)}))
#+end_src

#+RESULTS:
: #'clj-d2l.linreg-easy/trainer


** Initializing Model Parameters

#+begin_src clojure :results pp :exports both :eval no-export
(t/initialize trainer [(nd/shape batch-size 2)])
#+end_src

#+RESULTS:
: ai.djl.training.Trainer@4b641b7c

** Metrics

#+begin_src clojure :results silent :exports both
(def metrics (t/metrics))
(t/set-metrics trainer metrics)
#+end_src

