docs/3.3-concise-impl-of-linear-reg.html

<div id="outline-container-org7367288" class="outline-3">
<h3 id="org7367288"><span class="section-number-3">2.1.</span> Initializing Model Parameters</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Before using <code>net</code>, we need to initialize the model parameters, such as
the weights and bias in the linear regression model. Deep learning
frameworks often have a predefined way to initialize the parameters.
Here we specify that each weight parameter should be randomly sampled
from a normal distribution with mean 0 and standard deviation
0.01. The bias parameter will be initialized to zero.
</p>

<p>
We import the <code>initializer</code> namespace from <code>clj-djl</code>. This module provides
various methods for model parameter initialization. We only specify
how to initialize the weight by calling <code>(normal-initializer
0.01)</code>. Bias parameters are initialized to zero by default.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nn</span>/set-initializer net <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">initializer</span>/normal-initializer 0.01<span style="color: #7388d6;">)</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">parameter</span>/weight<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">model</span>/set-block model net<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
Model (
	Name: lin-reg
	Data Type: float32
)
</pre>


<p>
The code above may look straightforward but you should note that
something strange is happening here. We are initializing parameters
for a network even though clj-djl does not yet know how many
dimensions the input will have! It might be 2 as in our example or it
might be 2000. clj-djl lets us get away with this because behind the
scene, the initialization is actually deferred. The real
initialization will take place only when we for the first time attempt
to pass data through the network. Just be careful to remember that
since the parameters have not been initialized yet, we cannot access
or manipulate them.
</p>
</div>
</div>

<div id="outline-container-org8eb10fd" class="outline-3">
<h3 id="org8eb10fd"><span class="section-number-3">2.2.</span> Defining the Loss Function</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In clj-djl, the loss namespace defines various loss functions. In this
example, we will use the squared loss (l2-Loss).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">loss</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">loss</span>/l2-loss<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.linreg-easy/loss
</pre>
</div>
</div>


<div id="outline-container-org4db6ddf" class="outline-3">
<h3 id="org4db6ddf"><span class="section-number-3">2.3.</span> Defining the Optimization Algorithm</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Minibatch stochastic gradient descent is a standard tool for
optimizing neural networks and thus clj-djl supports it alongside a
number of variations on this algorithm through its <code>trainer</code>. When we
instantiate <code>trainer</code>, we will specify the parameters to optimize over,
the optimization algorithm we wish to use (sgd), and a dictionary of
hyperparameters required by our optimization algorithm. Minibatch
stochastic gradient descent just requires that we set the value
learning rate, which is set to 0.03 here.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">lrt</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">tracker</span>/fixed 0.3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">sgd</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">optimizer</span>/sgd <span style="color: #909183;">{</span><span style="color: #110099;">:tracker</span> lrt<span style="color: #909183;">}</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.linreg-easy/sgd
</pre>
</div>
</div>


<div id="outline-container-org8c9c3cd" class="outline-3">
<h3 id="org8c9c3cd"><span class="section-number-3">2.4.</span> Instantiate Configuration and Trainer</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">trainer</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/trainer <span style="color: #909183;">{</span><span style="color: #110099;">:model</span> model
                         <span style="color: #110099;">:loss</span> loss
                         <span style="color: #110099;">:optimizer</span> sgd
                         <span style="color: #110099;">:listeners</span> <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">listener</span>/logging<span style="color: #709870;">)</span><span style="color: #909183;">}</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.linreg-easy/trainer
</pre>
</div>
</div>


<div id="outline-container-org6397db0" class="outline-3">
<h3 id="org6397db0"><span class="section-number-3">2.5.</span> Initializing Model Parameters</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/initialize trainer <span style="color: #7388d6;">[</span><span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape batch-size 2<span style="color: #909183;">)</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ai.djl.training.Trainer@4b641b7c
</pre>
</div>
</div>

<div id="outline-container-org8c1a3fd" class="outline-3">
<h3 id="org8c1a3fd"><span class="section-number-3">2.6.</span> Metrics</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">metrics</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/metrics<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/set-metrics trainer metrics<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
