notes/3.3-concise-impl-of-linear-reg.org
** Saving Your Model

You can also save the model for future prediction task.

#+begin_src clojure :results pp :exports both
(defn save-model [model path epoch name]
  (let [nio-path (java.nio.file.Paths/get path (into-array [""]))]
    (io/make-parents path)
    (model/set-property model "Epoch" epoch)
    (model/save model nio-path name)))

(save-model model "models/lin-reg" "3" "lin-reg")
(println (str model))
#+end_src

#+RESULTS:
: Model (
: 	Name: lin-reg
: 	Model location: /home/kimim/workspace/clj-d2l/models/lin-reg
: 	Data Type: float32
: 	Epoch: 3
: )

** Summary

- Using clj-djl, we can implement models much more concisely.
- In clj-djl, the ~dataset~ namespace provides tools for data
  processing, the ~nn~ namespace defines a large number of neural
  network layers, and the ~loss~ namespace defines many common loss
  functions.
- ~initializer~ namespace provides various methods for model parameter
  initialization.
- Dimensionality and storage are automatically inferred, but be
  careful not to attempt to access parameters before they have been
  initialized.
