docs/3.3-concise-impl-of-linear-reg.html

<div id="outline-container-orgcb68d51" class="outline-3">
<h3 id="orgcb68d51"><span class="section-number-3">2.8.</span> Saving Your Model</h3>
<div class="outline-text-3" id="text-2-8">
<p>
You can also save the model for future prediction task.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">save-model</span> <span style="color: #7388d6;">[</span>model path epoch name<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>nio-path <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">java.nio.file.Paths</span>/<span style="color: #7F0055; font-weight: bold;">get</span> path <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">into-array</span> <span style="color: #6276ba;">[</span><span style="color: #2A00FF;">""</span><span style="color: #6276ba;">]</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">io</span>/make-parents path<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">model</span>/set-property model <span style="color: #2A00FF;">"Epoch"</span> epoch<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">model</span>/save model nio-path name<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>save-model model <span style="color: #2A00FF;">"models/lin-reg"</span> <span style="color: #2A00FF;">"3"</span> <span style="color: #2A00FF;">"lin-reg"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">str</span> model<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
Model (
	Name: lin-reg
	Model location: /home/kimim/workspace/clj-d2l/models/lin-reg
	Data Type: float32
	Epoch: 3
)
</pre>
</div>
</div>

<div id="outline-container-org1482f64" class="outline-3">
<h3 id="org1482f64"><span class="section-number-3">2.9.</span> Summary</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Using clj-djl, we can implement models much more concisely.</li>
<li>In clj-djl, the <code>dataset</code> namespace provides tools for data
processing, the <code>nn</code> namespace defines a large number of neural
network layers, and the <code>loss</code> namespace defines many common loss
functions.</li>
<li><code>initializer</code> namespace provides various methods for model parameter
initialization.</li>
<li>Dimensionality and storage are automatically inferred, but be
careful not to attempt to access parameters before they have been
initialized.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kimi Ma</p>
<p class="date">Created: 2022-05-17 Tue 08:06</p>
</div>
</body>
</html>
